Revit 2027 API
SiteSubRegion.SetBoundary Method
Note: This API is now obsolete.
 Set the given curve loops as the boundary of an existing SiteSubRegion.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
public void SetBoundary(
	IList<CurveLoop> curveLoops
)
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>
Public Sub SetBoundary (
	curveLoops As IList(Of CurveLoop)
)
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
void SetBoundary(
	IList<CurveLoop^>^ curveLoops
)
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>]
member SetBoundary :
        curveLoops : IList<CurveLoop> -> unit
Parameters
curveLoops IList<CurveLoop>
 A collection of curve loops to be added.
Exceptions
Exception | Condition
ArgumentException |  The input curve loops cannot compose a valid boundary, that means: no curve loop is contained in the given collection; these curve loops intersect with each other for some of them; or each curve loop is not closed individually; or each curve loop is not planar; or each curve loop is not in a plane parallel to the horizontal(XY) plane.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create the Sketch for the boundary of the current Subregion. -or- Cannot find an appropriate host topography surface for the SubRegion. -or- The given curve loops intersect with curve loops of existing SiteSubRegions hosted on the same TopographySurface. -or- The boundary of SubRegion is entirely inside or overlaps at least one existing BuildingPad hosted on the same TopographySurface. This behavior is not allowed.
ModificationForbiddenException |  The document containing this SiteSubRegion is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this SiteSubRegion is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document containing this SiteSubRegion has no open transaction.
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace